---
kind: type
id: T:Autodesk.Revit.DB.ExternallyTaggedGeometryValidation
source: html/3d89cbdb-0653-7820-5b94-e1fd8b6bf144.htm
---
# Autodesk.Revit.DB.ExternallyTaggedGeometryValidation

Provides validation for geometry to be stored in an ExternallyTaggedGeometry.

## Syntax (C#)
```csharp
public static class ExternallyTaggedGeometryValidation
```